; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared2 - mode
	image10 - mode
	thermograph1 - mode
	image7 - mode
	infrared3 - mode
	thermograph5 - mode
	spectrograph8 - mode
	thermograph0 - mode
	infrared9 - mode
	thermograph4 - mode
	spectrograph6 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image10)
	(supports instrument0 spectrograph6)
	(supports instrument0 spectrograph8)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image7)
	(supports instrument1 infrared3)
	(supports instrument1 infrared9)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 thermograph5)
	(supports instrument2 thermograph4)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(have_image Planet5 image10)
	(have_image Planet5 thermograph4)
	(have_image Planet5 thermograph0)
	(have_image Planet6 infrared3)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 spectrograph8)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon9 spectrograph8)
	(have_image Phenomenon9 thermograph4)
	(have_image Star10 image7)
	(have_image Star10 thermograph4)
))

)

; plan
1. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite0 star10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star10)
   goals met: 0 of 11
5. (take_image satellite0 star10 instrument1 image7)
   added: (have_image star10 image7)
   goals met: 1 of 11
6. (turn_to satellite0 planet6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet6)
   goals met: 1 of 11
7. (take_image satellite0 planet6 instrument1 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 2 of 11
8. (turn_to satellite0 star3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star3)
   goals met: 2 of 11
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
11. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 11
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 11
13. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 2 of 11
14. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 11
15. (take_image satellite0 phenomenon7 instrument0 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 3 of 11
16. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 11
17. (take_image satellite0 phenomenon9 instrument0 spectrograph8)
   added: (have_image phenomenon9 spectrograph8)
   goals met: 4 of 11
18. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   goals met: 4 of 11
19. (take_image satellite0 planet5 instrument0 image10)
   added: (have_image planet5 image10)
   goals met: 5 of 11
20. (turn_to satellite0 star8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star8)
   goals met: 5 of 11
21. (take_image satellite0 star8 instrument0 spectrograph8)
   added: (have_image star8 spectrograph8)
   goals met: 6 of 11
22. (turn_to satellite1 phenomenon9 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 11
23. (take_image satellite1 phenomenon9 instrument2 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 7 of 11
24. (take_image satellite1 phenomenon9 instrument2 thermograph4)
   added: (have_image phenomenon9 thermograph4)
   goals met: 8 of 11
25. (turn_to satellite1 planet5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet5)
   goals met: 8 of 11
26. (take_image satellite1 planet5 instrument2 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 9 of 11
27. (take_image satellite1 planet5 instrument2 thermograph4)
   added: (have_image planet5 thermograph4)
   goals met: 10 of 11
28. (turn_to satellite1 star10 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star10)
   goals met: 10 of 11
29. (take_image satellite1 star10 instrument2 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 11 of 11
